CSI API ETABS v1
cCaseResponseSpectrum.SetModalCase Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetModalCase(
	string Name,
	string ModalCase
)
Function SetModalCase (
	Name As String,
	ModalCase As String
) As Integer
Dim instance As cCaseResponseSpectrum
Dim Name As String
Dim ModalCase As String
Dim returnValue As Integer
returnValue = instance.SetModalCase(Name,
	ModalCase)
int SetModalCase(
	String^ Name,
	String^ ModalCase
)
abstract SetModalCase :
        Name : string *
        ModalCase : string -> int
Parameters
Name
Type: System.String
ModalCase
Type: System.String
Return Value
Type: Int32
See Also
Reference
cCaseResponseSpectrum Interface
ETABSv1 Namespace